cf_billing/Documents/бестРеализацияЮрЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестРеализацияЮрЛица</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бестАвансы</xr:Item>
				<xr:Item>AccumulationRegister.бестАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчётыПоУслугамЮрЛица</xr:Item>
				<xr:Item>AccumulationRegister.бестСуммаРеализации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПерезаполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыВыгрузкиДанныхПоНачислениямФЛВУчетнуюСистему</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСВнутри</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеПоДолевымСхемам</v8:Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеНП</v8:Type>
								<v8:Type>cfg:DocumentRef.энргРаспределениеПомещения</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачислениеПени</v8:Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеПениНП</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачислениеДляЛьготныхЛиц</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачислениеПоРассрочке</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
								<v8:Type>cfg:DocumentRef.бестПерерасчетНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеПоСхемамСтруктурыСети</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестСуммаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестСуммаРеализации</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Documents/бестРеализацияЮрЛица/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИсточникПоступления",	Справочники.энргИсточникиПоступления.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("ЭтоОплата",			Ложь);
	
	Ответственный 			= Пользователи.ТекущийПользователь();	
	энргДатаПоследнегоИзменения	= ТекущаяДата();
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеЗадолженность 					= ПолучитьЗадолженность();
	
	ВыборкаЗадолженность  					= ДанныеЗадолженность.выбрать();
	
	Пока ВыборкаЗадолженность.следующий() цикл
		Запись 						= Движения.бестСуммаРеализации.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,ВыборкаЗадолженность);			
	КонецЦикла; 
				
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗадолженность()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестРеализацияЮрЛицаУслуги.Услуга КАК Услуга,
		|	СУММА(бестРеализацияЮрЛицаУслуги.Сумма) КАК Сумма,
		|	СУММА(бестРеализацияЮрЛицаУслуги.СуммаНДС) КАК СуммаНДС,
		|	бестРеализацияЮрЛицаУслуги.Поставщик КАК Поставщик,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Договор КАК Договор,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Организация КАК Организация,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Район КАК Район,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.ПериодНачисления КАК ПериодНачисления,
		|	бестРеализацияЮрЛицаУслуги.СтавкаНДС КАК СтавкаНДС,
		|	бестРеализацияЮрЛицаУслуги.НДСВнутри КАК НДСВнутри,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.бестРеализацияЮрЛица.Услуги КАК бестРеализацияЮрЛицаУслуги
		|ГДЕ
		|	бестРеализацияЮрЛицаУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бестРеализацияЮрЛицаУслуги.Поставщик,
		|	бестРеализацияЮрЛицаУслуги.Услуга,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Договор,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.ПериодНачисления,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Район,
		|	бестРеализацияЮрЛицаУслуги.СтавкаНДС,
		|	бестРеализацияЮрЛицаУслуги.НДСВнутри,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Организация,
		|	бестРеализацияЮрЛицаУслуги.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
